import { observeble, action, computed } from "mobx";

export default class megaStore {
  // =================================================observable=================================================
  @observeble
  back;
  // ==================================================computed==================================================
  @computed
  // 애는 사용법이 기억이 잘 나질 않습니다.....
  // ===================================================action===================================================
  @action
  increase = () => {
    this.number--;
  };
}
